app/Models/UserModel.php

INSERT INTO `users` (`username`, `password`, `fullname`) VALUES ('lostxxangeles', '$2y$10$4EBvhOXQCA9Z1PwsXG6Jpueie26byDwLiSrR5pfU/wUMIiBc2AMWu', 'lucas')
---
    public function addUser($data)
    {
        $user = new \App\Entities\User();
        $user->username = $data['username'];
        $user->password = $data['password'];
        $user->fullname = $data['fullname'];
        $this->save($user);

SELECT *
FROM `users`
WHERE `username` = 'sherard'
 LIMIT 1
---
    public function login($username, $password)
    {
        $user = $this->where('username', $username)->first();